# Brew Taps
# tap 'heroku/brew'
# tap 'homebrew/cask-fonts'
tap 'homebrew/cask'
tap 'schniz/tap'
tap 'shopify/shopify'

# Brew Packages
brew 'composer'
# brew 'coreutils'
brew 'curl'
brew 'fnm'
brew 'git'
brew 'graphicsmagick'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'libyaml'
brew 'mas'
brew 'mmv'
brew 'php'
brew 'pipenv'
brew 'rename'
brew 'themekit'
brew 'tree'
brew 'tmux'
brew 'vim'
brew 'wget'
# brew 'wp-cli'
# brew 'yarn'
brew 'zsh'

# Cask Apps
# cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'adobe-creative-cloud-cleaner-tool'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'appcleaner'
cask 'balenaetcher'
cask 'balsamiq-wireframes'
cask 'basecamp'
cask 'caffeine'
cask 'cyberduck'
cask 'docker'
cask 'firefox'
cask 'gimp'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'logitech-unifying'
cask 'monolingual'
cask 'nomachine'
cask 'opera'
cask 'setapp'
cask 'simplenote'
cask 'sketch'
cask 'skype'
cask 'spotify'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'transmission'
cask 'trim-enabler'
cask 'tunnelbear'
cask 'tuxera-ntfs'
cask 'virtualbox-extension-pack'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoomus'

# MacOS App Store Apps
mas 'Pixelmator',  id: 407963104
mas 'SVGViewer',   id: 1239167834
mas 'WebP Viewer', id: 1323414118
